QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR32EA32def.inc
.equ PORTA_DIR = 0x0400                  ; Data Direction
.equ PORTA_DIRSET = 0x0401               ; Data Direction Set
.equ PORTA_DIRCLR = 0x0402               ; Data Direction Clear
.equ PORTA_DIRTGL = 0x0403               ; Data Direction Toggle
.equ PORTA_OUT = 0x0404                  ; Output Value
.equ PORTA_OUTSET = 0x0405               ; Output Value Set
.equ PORTA_OUTCLR = 0x0406               ; Output Value Clear
.equ PORTA_OUTTGL = 0x0407               ; Output Value Toggle
.equ PORTA_IN = 0x0408                   ; Input Value
.equ PORTA_INTFLAGS = 0x0409             ; Interrupt Flags
.equ PORTA_PORTCTRL = 0x040A             ; Port Control
.equ PORTA_PINCONFIG = 0x040B            ; Pin Control Config
.equ PORTA_PINCTRLUPD = 0x040C           ; Pin Control Update
.equ PORTA_PINCTRLSET = 0x040D           ; Pin Control Set
.equ PORTA_PINCTRLCLR = 0x040E           ; Pin Control Clear
.equ PORTA_PIN0CTRL = 0x0410             ; Pin 0 Control
.equ PORTA_PIN1CTRL = 0x0411             ; Pin 1 Control
.equ PORTA_PIN2CTRL = 0x0412             ; Pin 2 Control
.equ PORTA_PIN3CTRL = 0x0413             ; Pin 3 Control
.equ PORTA_PIN4CTRL = 0x0414             ; Pin 4 Control
.equ PORTA_PIN5CTRL = 0x0415             ; Pin 5 Control
.equ PORTA_PIN6CTRL = 0x0416             ; Pin 6 Control
.equ PORTA_PIN7CTRL = 0x0417             ; Pin 7 Control
.equ PORTA_EVGENCTRL = 0x0418            ; Event Generation Control

;*************************************************************************
;** PORTC - I/O Ports
;*************************************************************************

.equ PORTC_DIR = 0x0440                  ; Data Direction
.equ PORTC_DIRSET = 0x0441               ; Data Direction Set
.equ PORTC_DIRCLR = 0x0442               ; Data Direction Clear
.equ PORTC_DIRTGL = 0x0443               ; Data Direction Toggle
.equ PORTC_OUT = 0x0444                  ; Output Value
.equ PORTC_OUTSET = 0x0445               ; Output Value Set
.equ PORTC_OUTCLR = 0x0446               ; Output Value Clear
.equ PORTC_OUTTGL = 0x0447               ; Output Value Toggle
.equ PORTC_IN = 0x0448                   ; Input Value
.equ PORTC_INTFLAGS = 0x0449             ; Interrupt Flags
.equ PORTC_PORTCTRL = 0x044A             ; Port Control
.equ PORTC_PINCONFIG = 0x044B            ; Pin Control Config
.equ PORTC_PINCTRLUPD = 0x044C           ; Pin Control Update
.equ PORTC_PINCTRLSET = 0x044D           ; Pin Control Set
.equ PORTC_PINCTRLCLR = 0x044E           ; Pin Control Clear
.equ PORTC_PIN0CTRL = 0x0450             ; Pin 0 Control
.equ PORTC_PIN1CTRL = 0x0451             ; Pin 1 Control
.equ PORTC_PIN2CTRL = 0x0452             ; Pin 2 Control
.equ PORTC_PIN3CTRL = 0x0453             ; Pin 3 Control
.equ PORTC_PIN4CTRL = 0x0454             ; Pin 4 Control
.equ PORTC_PIN5CTRL = 0x0455             ; Pin 5 Control
.equ PORTC_PIN6CTRL = 0x0456             ; Pin 6 Control
.equ PORTC_PIN7CTRL = 0x0457             ; Pin 7 Control
.equ PORTC_EVGENCTRL = 0x0458            ; Event Generation Control

;*************************************************************************
;** PORTD - I/O Ports
;*************************************************************************

.equ PORTD_DIR = 0x0460                  ; Data Direction
.equ PORTD_DIRSET = 0x0461               ; Data Direction Set
.equ PORTD_DIRCLR = 0x0462               ; Data Direction Clear
.equ PORTD_DIRTGL = 0x0463               ; Data Direction Toggle
.equ PORTD_OUT = 0x0464                  ; Output Value
.equ PORTD_OUTSET = 0x0465               ; Output Value Set
.equ PORTD_OUTCLR = 0x0466               ; Output Value Clear
.equ PORTD_OUTTGL = 0x0467               ; Output Value Toggle
.equ PORTD_IN = 0x0468                   ; Input Value
.equ PORTD_INTFLAGS = 0x0469             ; Interrupt Flags
.equ PORTD_PORTCTRL = 0x046A             ; Port Control
.equ PORTD_PINCONFIG = 0x046B            ; Pin Control Config
.equ PORTD_PINCTRLUPD = 0x046C           ; Pin Control Update
.equ PORTD_PINCTRLSET = 0x046D           ; Pin Control Set
.equ PORTD_PINCTRLCLR = 0x046E           ; Pin Control Clear
.equ PORTD_PIN0CTRL = 0x0470             ; Pin 0 Control
.equ PORTD_PIN1CTRL = 0x0471             ; Pin 1 Control
.equ PORTD_PIN2CTRL = 0x0472             ; Pin 2 Control
.equ PORTD_PIN3CTRL = 0x0473             ; Pin 3 Control
.equ PORTD_PIN4CTRL = 0x0474             ; Pin 4 Control
.equ PORTD_PIN5CTRL = 0x0475             ; Pin 5 Control
.equ PORTD_PIN6CTRL = 0x0476             ; Pin 6 Control
.equ PORTD_PIN7CTRL = 0x0477             ; Pin 7 Control
.equ PORTD_EVGENCTRL = 0x0478            ; Event Generation Control

;*************************************************************************
;** PORTF - I/O Ports
;*************************************************************************

.equ PORTF_DIR = 0x04A0                  ; Data Direction
.equ PORTF_DIRSET = 0x04A1               ; Data Direction Set
.equ PORTF_DIRCLR = 0x04A2               ; Data Direction Clear
.equ PORTF_DIRTGL = 0x04A3               ; Data Direction Toggle
.equ PORTF_OUT = 0x04A4                  ; Output Value
.equ PORTF_OUTSET = 0x04A5               ; Output Value Set
.equ PORTF_OUTCLR = 0x04A6               ; Output Value Clear
.equ PORTF_OUTTGL = 0x04A7               ; Output Value Toggle
.equ PORTF_IN = 0x04A8                   ; Input Value
.equ PORTF_INTFLAGS = 0x04A9             ; Interrupt Flags
.equ PORTF_PORTCTRL = 0x04AA             ; Port Control
.equ PORTF_PINCONFIG = 0x04AB            ; Pin Control Config
.equ PORTF_PINCTRLUPD = 0x04AC           ; Pin Control Update
.equ PORTF_PINCTRLSET = 0x04AD           ; Pin Control Set
.equ PORTF_PINCTRLCLR = 0x04AE           ; Pin Control Clear
.equ PORTF_PIN0CTRL = 0x04B0             ; Pin 0 Control
.equ PORTF_PIN1CTRL = 0x04B1             ; Pin 1 Control
.equ PORTF_PIN2CTRL = 0x04B2             ; Pin 2 Control
.equ PORTF_PIN3CTRL = 0x04B3             ; Pin 3 Control
.equ PORTF_PIN4CTRL = 0x04B4             ; Pin 4 Control
.equ PORTF_PIN5CTRL = 0x04B5             ; Pin 5 Control
.equ PORTF_PIN6CTRL = 0x04B6             ; Pin 6 Control
.equ PORTF_PIN7CTRL = 0x04B7             ; Pin 7 Control
.equ PORTF_EVGENCTRL = 0x04B8            ; Event Generation Control

;*************************************************************************
;** PORTMUX - Port Multiplexer
;*************************************************************************

.equ PORTMUX_EVSYSROUTEA = 0x05E0        ; EVSYS route A
.equ PORTMUX_CCLROUTEA = 0x05E1          ; CCL route A
.equ PORTMUX_USARTROUTEA = 0x05E2        ; USART route A
.equ PORTMUX_USARTROUTEB = 0x05E3        ; USART route B
.equ PORTMUX_SPIROUTEA = 0x05E5          ; SPI route A
.equ PORTMUX_TWIROUTEA = 0x05E6          ; TWI route A
.equ PORTMUX_TCAROUTEA = 0x05E7          ; TCA route A
.equ PORTMUX_TCBROUTEA = 0x05E8          ; TCB route A
.equ PORTMUX_ACROUTEA = 0x05EA           ; AC route A

;*************************************************************************
;** RSTCTRL - Reset controller
;*************************************************************************

.equ RSTCTRL_RSTFR = 0x0040              ; Reset Flags
.equ RSTCTRL_SWRR = 0x0041               ; Software Reset

;*************************************************************************
;** RTC - Real-Time Counter
;*************************************************************************

.equ RTC_CTRLA = 0x0140                  ; Control A
.equ RTC_STATUS = 0x0141                 ; Status
.equ RTC_INTCTRL = 0x0142                ; Interrupt Control
.equ RTC_INTFLAGS = 0x0143               ; Interrupt Flags
.equ RTC_TEMP = 0x0144                   ; Temporary
.equ RTC_DBGCTRL = 0x0145                ; Debug control
.equ RTC_CALIB = 0x0146                  ; Calibration
.equ RTC_CLKSEL = 0x0147                 ; Clock Select
.equ RTC_CNT = 0x0148                    ; Counter
.equ RTC_CNTL = 0x0148                   ; Counter low byte
.equ RTC_CNTH = 0x0149                   ; Counter hi byte
.equ RTC_PER = 0x014A                    ; Period
.equ RTC_PERL = 0x014A                   ; Period low byte
.equ RTC_PERH = 0x014B                   ; Period hi byte
.equ RTC_CMP = 0x014C                    ; Compare
.equ RTC_CMPL = 0x014C                   ; Compare low byte
.equ RTC_CMPH = 0x014D                   ; Compare hi byte
.equ RTC_PITCTRLA = 0x0150               ; PIT Control A
.equ RTC_PITSTATUS = 0x0151              ; PIT Status
.equ RTC_PITINTCTRL = 0x0152             ; PIT Interrupt Control
.equ RTC_PITINTFLAGS = 0x0153            ; PIT Interrupt Flags
.equ RTC_PITDBGCTRL = 0x0155             ; PIT Debug control
.equ RTC_PITEVGENCTRLA = 0x0156          ; PIT Event Generation Control A

;*************************************************************************
;** SIGROW - Signature row
;*************************************************************************

.equ SIGROW_DEVICEID0 = 0x1100           ; Device ID Byte 0
.equ SIGROW_DEVICEID1 = 0x1101           ; Device ID Byte 1
.equ SIGROW_DEVICEID2 = 0x1102           ; Device ID Byte 2
.equ SIGROW_TEMPSENSE0 = 0x1104          ; Temperature Calibration 0
.equ SIGROW_TEMPSENSE0L = 0x1104         ; Temperature Calibration 0 low byte
.equ SIGROW_TEMPSENSE0H = 0x1105         ; Temperature Calibration 0 hi byte
.equ SIGROW_TEMPSENSE1 = 0x1106          ; Temperature Calibration 1
.equ SIGROW_TEMPSENSE1L = 0x1106         ; Temperature Calibration 1 low byte
.equ SIGROW_TEMPSENSE1H = 0x1107         ; Temperature Calibration 1 hi byte
.equ SIGROW_SERNUM0 = 0x1110             ; Serial Number Byte 0
.equ SIGROW_SERNUM1 = 0x1111             ; Serial Number Byte 1
.equ SIGROW_SERNUM2 = 0x1112             ; Serial Number Byte 2
.equ SIGROW_SERNUM3 = 0x1113             ; Serial Number Byte 3
.equ SIGROW_SERNUM4 = 0x1114             ; Serial Number Byte 4
.equ SIGROW_SERNUM5 = 0x1115             ; Serial Number Byte 5
.equ SIGROW_SERNUM6 = 0x1116             ; Serial Number Byte 6
.equ SIGROW_SERNUM7 = 0x1117             ; Serial Number Byte 7
.equ SIGROW_SERNUM8 = 0x1118             ; Serial Number Byte 8
.equ SIGROW_SERNUM9 = 0x1119             ; Serial Number Byte 9
.equ SIGROW_SERNUM10 = 0x111A            ; Serial Number Byte 10
.equ SIGROW_SERNUM11 = 0x111B            ; Serial Number Byte 11
.equ SIGROW_SERNUM12 = 0x111C            ; Serial Number Byte 12
.equ SIGROW_SERNUM13 = 0x111D            ; Serial Number Byte 13
.equ SIGROW_SERNUM14 = 0x111E            ; Serial Number Byte 14
.equ SIGROW_SERNUM15 = 0x111F            ; Serial Number Byte 15

;*************************************************************************
;** SLPCTRL - Sleep Controller
;*************************************************************************

