QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR32EA32def.inc
; ***** BIT AND VALUE DEFINITIONS ****************************************


;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************

; AC_CTRLA masks
.equ AC_ENABLE_bm = 0x01                 ; Enable bit mask
.equ AC_ENABLE_bp = 0                    ; Enable bit position
.equ AC_HYSMODE_gm = 0x06                ; Hysteresis Mode group mask
.equ AC_HYSMODE_gp = 1                   ; Hysteresis Mode group position
.equ AC_HYSMODE_0_bm = (1<<1)            ; Hysteresis Mode bit 0 mask
.equ AC_HYSMODE_0_bp = 1                 ; Hysteresis Mode bit 0 position
.equ AC_HYSMODE_1_bm = (1<<2)            ; Hysteresis Mode bit 1 mask
.equ AC_HYSMODE_1_bp = 2                 ; Hysteresis Mode bit 1 position
.equ AC_POWER_gm = 0x18                  ; Power profile group mask
.equ AC_POWER_gp = 3                     ; Power profile group position
.equ AC_POWER_0_bm = (1<<3)              ; Power profile bit 0 mask
.equ AC_POWER_0_bp = 3                   ; Power profile bit 0 position
.equ AC_POWER_1_bm = (1<<4)              ; Power profile bit 1 mask
.equ AC_POWER_1_bp = 4                   ; Power profile bit 1 position
.equ AC_OUTEN_bm = 0x40                  ; Output Pad Enable bit mask
.equ AC_OUTEN_bp = 6                     ; Output Pad Enable bit position
.equ AC_RUNSTDBY_bm = 0x80               ; Run in Standby Mode bit mask
.equ AC_RUNSTDBY_bp = 7                  ; Run in Standby Mode bit position

; AC_CTRLB masks
.equ AC_WINSEL_gm = 0x03                 ; Window selection mode group mask
.equ AC_WINSEL_gp = 0                    ; Window selection mode group position
.equ AC_WINSEL_0_bm = (1<<0)             ; Window selection mode bit 0 mask
.equ AC_WINSEL_0_bp = 0                  ; Window selection mode bit 0 position
.equ AC_WINSEL_1_bm = (1<<1)             ; Window selection mode bit 1 mask
.equ AC_WINSEL_1_bp = 1                  ; Window selection mode bit 1 position

; AC_MUXCTRL masks
.equ AC_MUXNEG_gm = 0x07                 ; Negative Input MUX Selection group mask
.equ AC_MUXNEG_gp = 0                    ; Negative Input MUX Selection group position
.equ AC_MUXNEG_0_bm = (1<<0)             ; Negative Input MUX Selection bit 0 mask
.equ AC_MUXNEG_0_bp = 0                  ; Negative Input MUX Selection bit 0 position
.equ AC_MUXNEG_1_bm = (1<<1)             ; Negative Input MUX Selection bit 1 mask
.equ AC_MUXNEG_1_bp = 1                  ; Negative Input MUX Selection bit 1 position
.equ AC_MUXNEG_2_bm = (1<<2)             ; Negative Input MUX Selection bit 2 mask
.equ AC_MUXNEG_2_bp = 2                  ; Negative Input MUX Selection bit 2 position
.equ AC_MUXPOS_gm = 0x38                 ; Positive Input MUX Selection group mask
.equ AC_MUXPOS_gp = 3                    ; Positive Input MUX Selection group position
.equ AC_MUXPOS_0_bm = (1<<3)             ; Positive Input MUX Selection bit 0 mask
.equ AC_MUXPOS_0_bp = 3                  ; Positive Input MUX Selection bit 0 position
.equ AC_MUXPOS_1_bm = (1<<4)             ; Positive Input MUX Selection bit 1 mask
.equ AC_MUXPOS_1_bp = 4                  ; Positive Input MUX Selection bit 1 position
.equ AC_MUXPOS_2_bm = (1<<5)             ; Positive Input MUX Selection bit 2 mask
.equ AC_MUXPOS_2_bp = 5                  ; Positive Input MUX Selection bit 2 position
.equ AC_INITVAL_bm = 0x40                ; AC Output Initial Value bit mask
.equ AC_INITVAL_bp = 6                   ; AC Output Initial Value bit position
.equ AC_INVERT_bm = 0x80                 ; Invert AC Output bit mask
.equ AC_INVERT_bp = 7                    ; Invert AC Output bit position

; AC_DACREF masks
.equ AC_DACREF_gm = 0xFF                 ; DACREF group mask
.equ AC_DACREF_gp = 0                    ; DACREF group position
.equ AC_DACREF_0_bm = (1<<0)             ; DACREF bit 0 mask
.equ AC_DACREF_0_bp = 0                  ; DACREF bit 0 position
.equ AC_DACREF_1_bm = (1<<1)             ; DACREF bit 1 mask
.equ AC_DACREF_1_bp = 1                  ; DACREF bit 1 position
.equ AC_DACREF_2_bm = (1<<2)             ; DACREF bit 2 mask
.equ AC_DACREF_2_bp = 2                  ; DACREF bit 2 position
.equ AC_DACREF_3_bm = (1<<3)             ; DACREF bit 3 mask
.equ AC_DACREF_3_bp = 3                  ; DACREF bit 3 position
.equ AC_DACREF_4_bm = (1<<4)             ; DACREF bit 4 mask
.equ AC_DACREF_4_bp = 4                  ; DACREF bit 4 position
.equ AC_DACREF_5_bm = (1<<5)             ; DACREF bit 5 mask
.equ AC_DACREF_5_bp = 5                  ; DACREF bit 5 position
.equ AC_DACREF_6_bm = (1<<6)             ; DACREF bit 6 mask
.equ AC_DACREF_6_bp = 6                  ; DACREF bit 6 position
.equ AC_DACREF_7_bm = (1<<7)             ; DACREF bit 7 mask
.equ AC_DACREF_7_bp = 7                  ; DACREF bit 7 position

; AC_INTCTRL masks
.equ AC_CMP_bm = 0x01                    ; Interrupt Enable bit mask
.equ AC_CMP_bp = 0                       ; Interrupt Enable bit position
.equ AC_INTMODE_NORMAL_gm = 0x30         ; Interrupt Mode group mask
.equ AC_INTMODE_NORMAL_gp = 4            ; Interrupt Mode group position
.equ AC_INTMODE_NORMAL_0_bm = (1<<4)     ; Interrupt Mode bit 0 mask
.equ AC_INTMODE_NORMAL_0_bp = 4          ; Interrupt Mode bit 0 position
.equ AC_INTMODE_NORMAL_1_bm = (1<<5)     ; Interrupt Mode bit 1 mask
.equ AC_INTMODE_NORMAL_1_bp = 5          ; Interrupt Mode bit 1 position
.equ AC_INTMODE_WINDOW_gm = 0x30         ; Interrupt Mode group mask
.equ AC_INTMODE_WINDOW_gp = 4            ; Interrupt Mode group position
.equ AC_INTMODE_WINDOW_0_bm = (1<<4)     ; Interrupt Mode bit 0 mask
.equ AC_INTMODE_WINDOW_0_bp = 4          ; Interrupt Mode bit 0 position
.equ AC_INTMODE_WINDOW_1_bm = (1<<5)     ; Interrupt Mode bit 1 mask
.equ AC_INTMODE_WINDOW_1_bp = 5          ; Interrupt Mode bit 1 position

; AC_STATUS masks
.equ AC_CMPIF_bm = 0x01                  ; Analog Comparator Interrupt Flag bit mask
.equ AC_CMPIF_bp = 0                     ; Analog Comparator Interrupt Flag bit position
.equ AC_CMPSTATE_bm = 0x10               ; Analog Comparator State bit mask
.equ AC_CMPSTATE_bp = 4                  ; Analog Comparator State bit position
.equ AC_WINSTATE_gm = 0xC0               ; Analog Comparator Window State group mask
.equ AC_WINSTATE_gp = 6                  ; Analog Comparator Window State group position
.equ AC_WINSTATE_0_bm = (1<<6)           ; Analog Comparator Window State bit 0 mask
.equ AC_WINSTATE_0_bp = 6                ; Analog Comparator Window State bit 0 position
.equ AC_WINSTATE_1_bm = (1<<7)           ; Analog Comparator Window State bit 1 mask
.equ AC_WINSTATE_1_bp = 7                ; Analog Comparator Window State bit 1 position

